/**********************************************************************/
/* PMDRC - P.M.D. reversal compiler by JUD(T.Terata)                  */
/* Variables                                                          */
/**********************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stddef.h>
#include <time.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <errno.h>

#include "prd.h"


/* デバッグ用 */
void *vp_debug=NULL;
void *vp_debug2=NULL;

/* インターフェース */
T_OPIF *gtp_gop; /* インターフェース */

/* 各種設定 */
int gi_zenlen=96; /* C/#Zenlen の暗黙値 */

/* 現在処理中のトラックに関する情報 */
T_TRACKTABLE *tp_curtra; /* 現在編集中トラック */
T_BOM *tp_BOMtop; /* マスタートラック先頭 */
int gi_bomnum; /* マスタートラックイベント数（整理前まで有効） */
int gi_llfindout=D_OFF; /* Lコマンドを発見した場合 D_ON */
int gi_tlinit=D_OFF; /* totallen 初期化済みフラグ */
char *cp_voiceaddr=NULL; /* ＦＭ音色アドレス */

/* 内部処理に関する情報 */
int gi_stockbons=0; /* 現在ストックされている再利用待ち個別部数 */
T_BON *gtps_stockbon[256]; /* 現在ストックされている再利用待ち個別部 */
T_GINFO gt_ginfo; /* 曲のグローバル情報 */
T_TRACKTABLE ts_ts[DN_MAX_TRACKNUM];
char gcs_line[DN_SIZE_LINEBUFFER]; /* hfpf()用バッファ */
char gc_lastoutcat; /* 前回出力したコードカテゴリ (MML出力時に使用する) */
char gc_lastoutchar; /* 前回出力したコード */
int iss_notelenfreq[DN_MAX_TRACKNUM][DN_MAX_NOTELENFREQ+1];


/* コード→ＭＭＬ 対応テーブル */
T_TCODE	ts_tc[DN_MAX_CONTROLCODE]	={
/*    c  op-code         s F L t s MML MML     */
/*    n                  i m v b te    Format  */
/*    t     1    2 3    ze t l l p             */
	{ 1, 0x7F,0x00,0,0 , 1,2,4,1,1,""   }, /* 0x00-0x7F */
	{ 1, 0x91,0x00,0,0 , 1,3,4,1,0," "  }, /* MML出力の0x20 */
	{ 1, 0xB1,0x00,0,0 , 1,5,2,0,0,"q random" },
	{ 1, 0xB2,0x00,0,0 , 1,4,2,1,0,"_M" }, /* _M master転調 */
	{ 1, 0xB3,0x00,0,0 , 1,5,2,0,0,"q"  },
	{ 1, 0xB4,0x00,0,0 ,16,1,2,0,0,"PPZExtend" }, /* #PPZExtend */
	{ 1, 0xB5,0x00,0,0 , 2,6,2,0,0,"sk","_,_"},
	{ 1, 0xB6,0x00,0,0 , 1,5,2,0,0,"FB" },
	{ 1, 0xB7,1,0x80,0 , 1,6,2,0,0,"MDB",",,b" },
	{ 1, 0xB7,0,0x80,0 , 1,6,2,0,0,"MDA",",,b" },
	{ 1, 0xB8,0x00,0,0 , 2,6,2,0,0,"O","#,#"}, /* 1byteにflagの可能性あり */
	{ 1, 0xB9,0x00,0,0 , 1,5,2,0,0,"MB" },
	{ 1, 0xBA,0x00,0,0 , 1,5,2,0,0,"MMB"},
	{ 1, 0xBB,0x00,0,0 , 1,5,2,0,0,"MXB"},
	{ 1, 0xBC,0x00,0,0 , 1,5,2,0,0,"MWB"},
	{ 1, 0xBD,0x00,0,0 , 2,6,2,0,0,"MDB","#,_"}, /* MDB本筋 */
	{ 1, 0xBE,0x00,0,0 , 1,5,2,0,0,"*B" },
	{ 1, 0xBF,0x00,0,0 , 4,6,2,0,0,"MB","_,_,#,_" },
	{ 1, 0xC0,0xF5,0,0 , 2,6,2,0,0,"DZ"," ("},
	{ 1, 0xC0,0xF6,0,0 , 2,6,2,0,0,"DZ"," _"},
	{ 1, 0xC0,0xF7,0,0 , 2,6,2,0,0,"A" ," _"},
	{ 1, 0xC0,0xF8,0,0 , 2,6,2,0,0,"DR"," ("},
	{ 1, 0xC0,0xF9,0,0 , 2,6,2,0,0,"DR"," _"},
	{ 1, 0xC0,0xFA,0,0 , 2,6,2,0,0,"DP"," ("},
	{ 1, 0xC0,0xFB,0,0 , 2,6,2,0,0,"DP"," _"},
	{ 1, 0xC0,0xFC,0,0 , 2,6,2,0,0,"DD"," ("},
	{ 1, 0xC0,0xFD,0,0 , 2,6,2,0,0,"DD"," _"},
	{ 1, 0xC0,0xFE,0,0 , 2,6,2,0,0,"DF"," ("},
	{ 1, 0xC0,0xFF,0,0 , 2,6,2,0,0,"DF"," _"},
	{ 1, 0xC0,0x00,0,0 , 1,5,2,0,0,"m"  },
	{ 1, 0xC1,0x00,0,0 , 0,3,4,1,0,"&&" }, /* && スラー */
	{ 1, 0xC2,0x00,0,0 , 1,5,2,0,0,"MA" },
	{ 1, 0xC3,0x00,0,0 , 2,6,0,0,0,"px","(,#" },
	{ 1, 0xC4,0x00,0,0 , 1,5,2,0,0,"Q"  }, /* よくわからん */
	{ 1, 0xC5,0x00,0,0 , 1,5,2,0,0,"MM" },
	{ 1, 0xC6,0x00,0,0 , 6,1,2,0,0,"FM3Extend" }, /* #FM3Extend */
	{ 1, 0xC7,0x00,0,0 , 3,6,2,0,0,"sdd","_,)"}, /*slot3detune相対 */
	{ 1, 0xC8,0x00,0,0 , 3,6,2,0,0,"sd" ,"_,)"}, /*slot3detune絶対 */
	{ 1, 0xC9,0x00,0,0 , 1,5,2,0,0,"EX" },
	{ 1, 0xCA,0x00,0,0 , 1,5,2,0,0,"MX" },
	{ 1, 0xCB,0x00,0,0 , 1,5,2,0,0,"MW" },
	{ 1, 0xCC,0x00,0,0 , 1,5,2,0,0,"DX" }, /* SSG音源音程補正指定 */
	{ 1, 0xCD,0x00,0,0 , 5,6,2,0,0,"E","_,_,_,_,_"}, /* SSG拡張ENV */
	{ 1, 0xCE,0x00,0,0 , 6,6,2,0,0,",","$,$,$"},
	{ 1, 0xCF,0x00,0,0 , 1,5,2,0,0,"s"  }, /* fm_slot_mask+carrier ? */
	{ 1, 0xD0,0x00,0,0 , 1,7,2,0,0,"w"  },
	{ 1, 0xD1,0x00,0,0 , 1,5,2,0,0,"\?" }, /* for px */
	{ 1, 0xD2,0x00,0,0 , 1,5,2,0,0,"F"  },
	{ 1, 0xD3,0x00,0,0 , 1,5,2,0,0,"N"  },
	{ 1, 0xD4,0x00,0,0 , 1,5,2,0,0,"n"  },
	{ 1, 0xD5,0x00,0,0 , 2,7,2,0,0,"DD" },
	{ 1, 0xD6,0x00,0,0 , 2,6,2,0,0,"MDA","#,_"}, /* MDA本筋 */
	{ 1, 0xD7,0x00,0,0 , 1,0,2,0,0,"PMD68"  }, /* for pmd68 */
	{ 1, 0xD8,0x00,0,0 , 1,0,2,0,0,"PMD68"  }, /* for pmd68 */
	{ 1, 0xD9,0x00,0,0 , 1,0,2,0,0,"PMD68"  }, /* for pmd68 */
	{ 1, 0xDA,0x00,0,0 , 3,2,4,1,1,"Portament" }, /* {ab} porta */
	{ 1, 0xDB,0x00,0,0 , 1,7,2,0,0,"~"  },
	{ 1, 0xDC,0x00,0,0 , 1,4,2,0,0,"~"  },
	{ 1, 0xDD,0x00,0,0 , 1,5,2,0,0,")^%"},
	{ 1, 0xDE,0x00,0,0 , 1,5,2,0,0,"(^%"},
	{ 1, 0xDF,0x00,0,0 , 1,5,3,0,0,"Z"  }, /* Z 小節長さ */
	{ 1, 0xE0,0x00,0,0 , 1,5,2,0,0,"*"  }, /* hardlfo よくわからん */
	{ 1, 0xE1,0x00,0,0 , 1,0,2,0,0,"H"  }, /* hardlfo よくわからん */
	{ 1, 0xE2,0x00,0,0 , 1,8,2,0,0,"(%"  },
	{ 1, 0xE3,0x00,0,0 , 1,8,2,0,0,")%"  },
	{ 1, 0xE4,0x00,0,0 , 1,5,2,0,0,"#D" }, /* hardlfo-delay */
	{ 1, 0xE5,0x00,0,0 , 2,0,2,0,0,"\\\\v"}, /* 'R' */
	{ 1, 0xE6,0x00,0,0 , 1,0,2,0,0,"\\\\V"}, /* 'R' */
	{ 1, 0xE7,0x00,0,0 , 1,4,2,1,0,"__" }, /* __ 相対転調 */
	{ 1, 0xE8,0x00,0,0 , 1,0,2,0,0,"\\\\v(master)" }, /* 'R' */
	{ 1, 0xE9,0x00,0,0 , 1,0,2,0,0,"\\\\(r|m)" }, /* 'R' */
	{ 1, 0xEA,0x00,0,0 , 1,0,2,0,0,"\\\\v"}, /* 'R' */
	{ 1, 0xEB,0x00,0,0 , 1,0,2,0,0,"\\?" }, /* 'R' */
	{ 1, 0xEC,0x00,0,0 , 1,5,2,0,0,"p"  },
	{ 1, 0xED,0x00,0,0 , 1,5,2,0,0,"P"  },
	{ 1, 0xEE,0x00,0,0 , 1,4,2,0,0,"w"  },
	{ 1, 0xEF,0x00,0,0 , 2,6,2,0,0,"y","_,_"},
	{ 1, 0xF0,0x00,0,0 , 4,6,2,0,0,"E","_,#,_,_"},/* SSG基本ENV */
	{ 1, 0xF1,0x00,0,0 , 1,5,2,0,0,"*A"  },
	{ 1, 0xF2,0x00,0,0 , 4,6,2,0,0,"MA","_,_,#,_"},
	{ 1, 0xF3,0x00,0,0 , 0,3,2,0,0,"("  },
	{ 1, 0xF4,0x00,0,0 , 0,3,2,0,0,")"  },
	{ 1, 0xF5,0x00,0,0 , 1,7,2,1,0,"_"  }, /* _ 絶対転調 */
	{ 1, 0xF6,0x00,0,0 , 0,3,4,0,2,"L " }, /* L 全体ループ */
	{ 1, 0xF7,0x00,0,0 , 2,3,4,0,2,":"  }, /* : ループ出口 */
	{ 1, 0xF8,0x00,0,0 , 4,5,4,0,2,"]"  }, /* ] ループ終点 */
	{ 1, 0xF9,0x00,0,0 , 2,3,4,0,2,"["  }, /* [ ループ始点 */
	{ 1, 0xFA,0x00,0,0 , 2,6,2,0,0,"D","$"},
	{ 1, 0xFB,0x00,0,0 , 0,3,4,1,2,"&"  }, /* & タイ/スラー */
	{ 1, 0xFC,0xFD,0,0 , 2,6,3,0,0,"t"," _"},
	{ 1, 0xFC,0xFE,0,0 , 2,6,3,0,0,"T"," ("},
	{ 1, 0xFC,0xFF,0,0 , 2,6,3,0,0,"t"," ("},
	{ 1, 0xFC,0x00,0,0 , 1,5,3,0,0,"T"  },
	{ 1, 0xFD,0x00,0,0 , 1,5,2,0,0,"V"  },
	{ 1, 0xFE,0x00,0,0 , 1,5,2,0,0,"q"  },
	{ 1, 0xFF,0x00,0,0 , 1,5,3,0,0,"@"  }, /* @ 音色設定 */
	{ 0, 0x00,0x00,0,0 , 0,0,0,0,0,""   }
/*    c  op-code         s F L t s MML MML     */
/*    n                  i m v b te    Format  */
/*    t     1    2 3    ze t l l p             */
};

/* コードの音程を表す４ビット→ＭＭＬ変換テーブル */
char *cps_note[16] ={
"c","c+","d","d+",
"e","f","f+","g",
"g+","a","a+","b",
" "," "," ","r"};



